# Hierarchical Indexing

In [1]:
import numpy as np
import pandas as pd

## A Multiply Indexed Series

### The Bad Way

In [55]:
index = [('California', 2010), ('California', 2020),
                 ('New York', 2010), ('New York', 2020),
                 ('Texas', 2010), ('Texas', 2020)]
populations = [37253956, 39538223,
               19378102, 20201249,
               25145561, 29145505]

In [56]:
pop = pd.Series(populations, index=index)
pop

(California, 2010)    37253956
(California, 2020)    39538223
(New York, 2010)      19378102
(New York, 2020)      20201249
(Texas, 2010)         25145561
(Texas, 2020)         29145505
dtype: int64

In [46]:
pop[('California', 2020):('Texas', 2010)]

(California, 2020)    39538223
(New York, 2010)      19378102
(New York, 2020)      20201249
(Texas, 2010)         25145561
dtype: int64

In [50]:
ind = [i for i in pop.index if i[1] == 2010]
ind

[('California', 2010), ('New York', 2010), ('Texas', 2010)]

In [51]:
pop[ind]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

### The Better Way: The Pandas MultiIndex

In [60]:
multi_index = pd.MultiIndex.from_tuples(index)
multi_index

MultiIndex([('California', 2010),
            ('California', 2020),
            (  'New York', 2010),
            (  'New York', 2020),
            (     'Texas', 2010),
            (     'Texas', 2020)],
           )

In [70]:
pop = pop.reindex(multi_index)

In [71]:
pop[:, 2020]

California    39538223
New York      20201249
Texas         29145505
dtype: int64

### MultiIndex as Extra Dimension

In [112]:
pop

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [113]:
pop_df = pop.unstack()
pop_df

                2010      2020
California  37253956  39538223
New York    19378102  20201249
Texas       25145561  29145505

In [114]:
pop_df.loc['Texas', 2010]

25145561

In [115]:
pop_df.stack()

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [121]:
pop_df1 = pd.DataFrame({'total': pop,'under18': [9284094, 8898092, 4318033, 4181528, 6879014, 7432474]})
pop_df1

                    total  under18
California 2010  37253956  9284094
           2020  39538223  8898092
New York   2010  19378102  4318033
           2020  20201249  4181528
Texas      2010  25145561  6879014
           2020  29145505  7432474

In [122]:
f_u18 = pop_df1['under18'] / pop_df1['total']
f_u18

California  2010    0.249211
            2020    0.225050
New York    2010    0.222831
            2020    0.206994
Texas       2010    0.273568
            2020    0.255013
dtype: float64

In [123]:
pop_df1['f_u18'] = f_u18 
pop_df1

                    total  under18     f_u18
California 2010  37253956  9284094  0.249211
           2020  39538223  8898092  0.225050
New York   2010  19378102  4318033  0.222831
           2020  20201249  4181528  0.206994
Texas      2010  25145561  6879014  0.273568
           2020  29145505  7432474  0.255013

## Methods of MultiIndex Creation

In [129]:
df = pd.DataFrame(np.random.rand(4, 2),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=['data1', 'data2'])
df

        data1     data2
a 1  0.073912  0.908834
  2  0.625611  0.917667
b 1  0.318898  0.618902
  2  0.688624  0.686559

In [133]:
df.loc[('a', 1), 'data1']

0.07391241565383955

In [136]:
df2 = pd.DataFrame(np.random.rand(4, 4),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                    columns=[['data1', 'data1', 'data2', 'data2'], ['test1', 'test2', 'test1', 'test2']])
df2

        data1               data2
        test1     test2     test1     test2
a 1  0.879680  0.575580  0.311939  0.371944
  2  0.179253  0.895977  0.203889  0.997004
b 1  0.751148  0.391745  0.989960  0.325124
  2  0.104396  0.264506  0.937911  0.696936

In [213]:
df2.loc[('a', 1), ('data1', 'test1')]

0.8796798189342429

In [154]:
data = {('California', 2010): 37253956,
        ('California', 2020): 39538223,
        ('New York', 2010): 19378102,
        ('New York', 2020): 20201249,
        ('Texas', 2010): 25145561,
        ('Texas', 2020): 29145505}

pd.Series(data)

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

### Explicit MultiIndex Constructors

pd.MultiIndex.from_arrays()
pd.MultiIndex.from_frame()
pd.MultiIndex.from_product()
pd.MultiIndex.from_tuples()
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [158]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [159]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [163]:
 pd.MultiIndex.from_product([['a', 'b'], [1, 2]]) # most convenient as of now

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [162]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
                       codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

### MultiIndex Level Names

In [164]:
pop.index.names = ['state', 'year']
pop

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [176]:
pd.MultiIndex.from_product([['a', 'b'],[1, 2]], names=['char', 'int'])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['char', 'int'])

In [175]:
pd.DataFrame(np.random.randint(0, 9, size=(4, 2)), index=pd.MultiIndex.from_product([['a', 'b'],[1, 2]], names=['char', 'int']), columns=['data1', 'data2'])

          data1  data2
char int
a    1        1      7
     2        6      6
b    1        4      5
     2        7      7

### MultiIndex for Columns

In [178]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]], names=['year', 'visit'])

columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'],['HR', 'Temp']], names=['subject', 'type'])

# mock some data

data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      56.0  38.5  42.0  36.8  24.0  35.3
     2      27.0  37.8  37.0  36.0  41.0  37.2
2014 1      41.0  37.2  44.0  37.5  42.0  37.7
     2      31.0  36.1  44.0  36.8  41.0  35.0

In [180]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      42.0  36.8
     2      37.0  36.0
2014 1      44.0  37.5
     2      44.0  36.8

In [179]:
health_data['Guido', 'HR']

year  visit
2013  1        42.0
      2        37.0
2014  1        44.0
      2        44.0
Name: (Guido, HR), dtype: float64

In [183]:
health_data['Guido', 'HR'][2013]

visit
1    42.0
2    37.0
Name: (Guido, HR), dtype: float64

In [184]:
health_data['Guido', 'HR'][2013, 1]

42.0

In [214]:
health_data.loc[(2013, 1), ('Guido', 'HR')]

42.0

## Indexing and Slicing a MultiIndex

### Multiply Indexed Series

In [185]:
pop

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [188]:
pop['California', 2010]

37253956

In [189]:
pop['California']

year
2010    37253956
2020    39538223
dtype: int64

In [191]:
pop.loc['California':'New york']

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
dtype: int64

In [192]:
pop[:, 2010]

state
California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [193]:
pop[pop > 20000000]

state       year
California  2010    37253956
            2020    39538223
New York    2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [194]:
pop[['California', 'Texas']]

state       year
California  2010    37253956
            2020    39538223
Texas       2010    25145561
            2020    29145505
dtype: int64

### Multiply Indexed DataFrames

In [195]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      56.0  38.5  42.0  36.8  24.0  35.3
     2      27.0  37.8  37.0  36.0  41.0  37.2
2014 1      41.0  37.2  44.0  37.5  42.0  37.7
     2      31.0  36.1  44.0  36.8  41.0  35.0

In [196]:
health_data['Guido', 'HR']

year  visit
2013  1        42.0
      2        37.0
2014  1        44.0
      2        44.0
Name: (Guido, HR), dtype: float64

In [206]:
health_data.iloc[0:1, 0:1]

subject      Bob
type          HR
year visit
2013 1      56.0

In [207]:
health_data.iloc[0:2, 0:1]

subject      Bob
type          HR
year visit
2013 1      56.0
     2      27.0

In [208]:
health_data.iloc[0:3, 0:1]

subject      Bob
type          HR
year visit
2013 1      56.0
     2      27.0
2014 1      41.0

In [209]:
health_data.iloc[0:3, 0:2]

subject      Bob
type          HR  Temp
year visit
2013 1      56.0  38.5
     2      27.0  37.8
2014 1      41.0  37.2

In [210]:
health_data.iloc[0:3, 0:3]

subject      Bob       Guido
type          HR  Temp    HR
year visit
2013 1      56.0  38.5  42.0
     2      27.0  37.8  37.0
2014 1      41.0  37.2  44.0

In [212]:
health_data.loc[(2013, 1), ('Bob', 'HR')]

56.0

In [218]:
health_data.loc[(2013, 2):(2014, 2), ('Bob', 'Temp'):('Guido', 'Temp')]

subject      Bob Guido
type        Temp    HR  Temp
year visit
2013 2      37.8  37.0  36.0
2014 1      37.2  44.0  37.5
     2      36.1  44.0  36.8

In [216]:
%xmode minimal

Exception reporting mode: Minimal

In [217]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (3311942670.py, line 1)

In [219]:
idx = pd.IndexSlice

health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      56.0  42.0  24.0
2014 1      41.0  44.0  42.0

In [220]:
health_data.loc[idx[:, [1, 2]], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      56.0  42.0  24.0
     2      27.0  37.0  41.0
2014 1      41.0  44.0  42.0
     2      31.0  44.0  41.0

In [221]:
health_data.loc[idx[:, 1], idx[['Bob', 'Sue'], 'HR']]

subject      Bob   Sue
type          HR    HR
year visit
2013 1      56.0  24.0
2014 1      41.0  42.0

## Rearranging Multi-Indexes

### Sorted and Unsorted Indices

In [222]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.671419
      2      0.480316
c     1      0.923085
      2      0.994181
b     1      0.888464
      2      0.895918
dtype: float64

In [223]:
data['a':'b']

UnsortedIndexError: 'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [224]:
data = data.sort_index()
data

char  int
a     1      0.671419
      2      0.480316
b     1      0.888464
      2      0.895918
c     1      0.923085
      2      0.994181
dtype: float64

In [225]:
data['a':'b']

char  int
a     1      0.671419
      2      0.480316
b     1      0.888464
      2      0.895918
dtype: float64

### Stacking and Unstacking Indices

In [226]:
pop

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [230]:
pop.unstack(level=0)

state  California  New York     Texas
year
2010     37253956  19378102  25145561
2020     39538223  20201249  29145505

In [231]:
pop.unstack(level=1)

year            2010      2020
state
California  37253956  39538223
New York    19378102  20201249
Texas       25145561  29145505

In [232]:
pop.unstack()

year            2010      2020
state
California  37253956  39538223
New York    19378102  20201249
Texas       25145561  29145505

In [245]:
pop.unstack().stack()

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

### Index Setting and Resetting

In [247]:
pop_df1

                    total  under18     f_u18
state      year
California 2010  37253956  9284094  0.249211
           2020  39538223  8898092  0.225050
New York   2010  19378102  4318033  0.222831
           2020  20201249  4181528  0.206994
Texas      2010  25145561  6879014  0.273568
           2020  29145505  7432474  0.255013

In [251]:
pop_df1_flat = pop_df1.reset_index()
pop_df1_flat

        state  year     total  under18     f_u18
0  California  2010  37253956  9284094  0.249211
1  California  2020  39538223  8898092  0.225050
2    New York  2010  19378102  4318033  0.222831
3    New York  2020  20201249  4181528  0.206994
4       Texas  2010  25145561  6879014  0.273568
5       Texas  2020  29145505  7432474  0.255013

In [250]:
pop

state       year
California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

In [252]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2010    37253956
1  California  2020    39538223
2    New York  2010    19378102
3    New York  2020    20201249
4       Texas  2010    25145561
5       Texas  2020    29145505

In [256]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2010    37253956
           2020    39538223
New York   2010    19378102
           2020    20201249
Texas      2010    25145561
           2020    29145505